# Homebrew Bundle Brewfile
# 使い方:
#   brew bundle --file=~/.dotfiles/Brewfile
#
# 補足:
#   - cask は GUI アプリ
#   - 既存手動インストールのアプリはコメントアウト（brew 管理に移行したいときに外す）
#   - 無効/廃止の cask はコメントアウト

# taps（必要なものだけ）
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "go-task/tap"

# formulae（brew 管理済み / leaf）
brew "fzf"
brew "gh"
brew "ghq"
brew "git"
brew "go-task"
brew "lazygit"
brew "mise"
brew "neovim"
brew "ollama"
brew "opencode"
brew "sheldon"
brew "starship"
brew "stow"
brew "tree"
brew "zoxide"

# cask（brew 管理済み）
cask "claude-code"
cask "codex"
cask "docker-desktop"
cask "easydict"
cask "font-udev-gothic-nf"
cask "nudge"
cask "wezterm@nightly"

# cask（既存アプリは一旦保留）
# cask "1password"
# cask "alfred"
# cask "alt-tab"
# cask "amical"
# cask "appcleaner"
# cask "bettertouchtool"
# cask "chatgpt"
# cask "claude"
# cask "coteditor"
# cask "discord"
# cask "docker-desktop"
# cask "dropbox"
# cask "easydict"
# cask "figma"
# cask "google-chrome"
# cask "google-drive"
# cask "google-japanese-ime"
# cask "hiddenbar"
# cask "iterm2"
# cask "karabiner-elements"
# cask "logi-options+"
# cask "loupedeck"
# cask "microsoft-teams"
# cask "notion"
# cask "notion-calendar"
# cask "notion-mail"
# cask "nudge"
# cask "onedrive"
# cask "slack"
# cask "soundsource"
# cask "tableplus"
# cask "visual-studio-code"
# cask "wezterm"
# cask "yoink"

# deprecated/disabled
# cask "affinity-photo" # deprecated
# cask "dia"            # disabled
# cask "kindle"         # disabled
