# Homebrew Bundle Brewfile
# 使い方:
#   brew bundle --file=~/ghq/github.com/yoshihiko555/dotfiles/Brewfile
#
# 補足:
#   - cask は GUI アプリ
#   - 既存手動インストールのアプリはコメントアウト（brew 管理に移行したいときに外す）
#   - 無効/廃止の cask はコメントアウト

# taps（必要なものだけ）
tap "coderabbitai/tap"
tap "go-task/tap"
tap "homebrew-ffmpeg/ffmpeg"
tap "morantron/tmux-fingers"
tap "nikitabobko/tap"

# formulae（brew 管理済み / leaf）
brew "agent-browser"
brew "coderabbitai/tap/git-gtr"
brew "d2"
brew "fzf"
brew "gemini-cli"
brew "gh"
brew "ghq"
brew "git"
brew "glow"
brew "go-task"
brew "gopls"
brew "homebrew-ffmpeg/ffmpeg/ffmpeg"
brew "lazygit"
brew "libomp"
brew "mise"
brew "morantron/tmux-fingers/tmux-fingers"
brew "neovim"
brew "ollama"
brew "opencode"
brew "pyright"
brew "sheldon"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "tmux"
brew "tree"
brew "typescript"
brew "typescript-language-server"
brew "yazi"
brew "zoxide"

# cask（brew 管理済み）
cask "1password-cli"
cask "aerospace"
cask "claude-code@latest"
cask "codex"
cask "docker-desktop"
cask "easydict"
cask "font-udev-gothic-nf"
cask "ghostty"
cask "orbstack"
cask "proxy-audio-device"
cask "wezterm@nightly"
cask "zed"

# cask（既存アプリは一旦保留）
# cask "1password"
# cask "alfred"
# cask "alt-tab"
# cask "amical"
# cask "appcleaner"
# cask "bettertouchtool"
# cask "chatgpt"
# cask "claude"
# cask "coteditor"
# cask "discord"
# cask "docker-desktop"
# cask "dropbox"
# cask "easydict"
# cask "figma"
# cask "google-chrome"
# cask "google-drive"
# cask "google-japanese-ime"
# cask "hiddenbar"
# cask "iterm2"
# cask "karabiner-elements"
# cask "logi-options+"
# cask "loupedeck"
# cask "microsoft-teams"
# cask "notion"
# cask "notion-calendar"
# cask "notion-mail"
# cask "nudge"
# cask "onedrive"
# cask "slack"
# cask "soundsource"
# cask "tableplus"
# cask "visual-studio-code"
# cask "wezterm"
# cask "yoink"

# deprecated/disabled
# cask "affinity-photo" # deprecated
# cask "dia"            # disabled
# cask "kindle"         # disabled
